; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	thermograph3 - mode
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 thermograph3)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 thermograph3)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument4 image1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
)
(:goal (and
	(pointing satellite3 GroundStation4)
	(have_image Phenomenon5 image1)
	(have_image Planet6 thermograph3)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 image1)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite2 star0 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star0)
   goals met: 0 of 8
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite2 phenomenon9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite2 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon7 instrument3 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon5 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 8
9. (take_image satellite2 phenomenon5 instrument3 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 8
10. (turn_to satellite2 planet10 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet10)
   goals met: 3 of 8
11. (take_image satellite2 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 4 of 8
12. (turn_to satellite2 planet11 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet11)
   goals met: 4 of 8
13. (take_image satellite2 planet11 instrument3 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 8
14. (turn_to satellite2 planet6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet6)
   goals met: 5 of 8
15. (take_image satellite2 planet6 instrument3 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 6 of 8
16. (turn_to satellite2 star8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star8)
   goals met: 6 of 8
17. (take_image satellite2 star8 instrument3 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 7 of 8
18. (turn_to satellite3 groundstation4 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 groundstation4)
   goals met: 8 of 8
